# 01. Analysis Seoul CCTV

## 1. 데이터 읽기

In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv("../data/01. Seoul_CCTV.csv")
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

In [6]:
CCTV_Seoul.rename(columns = {CCTV_Seoul.columns[0] : "구별"}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [8]:
pop_Seoul = pd.read_excel("../data/01. Seoul_Population.xls", header = 2, usecols = "B, D, G, J, N")
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [9]:
pop_Seoul.rename(
    columns = {
        pop_Seoul.columns[0] : "구별",
        pop_Seoul.columns[1] : "인구수",
        pop_Seoul.columns[2] : "한국인",
        pop_Seoul.columns[3] : "외국인",
        pop_Seoul.columns[4] : "고령자",
    },
    inplace = True
)
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

## Pandas 기초
- Python에서 R 만큼의 강력한 데이터 핸들링 성능을 제공하는 모듈
- 단일 프로세스에서는 최대 효율
- 코딩 가능하고 응용 가능한 엑셀로 받아들여도 됨
- 누군가 스테로이드를 맞은 엑셀로 표현함

  #### Series
- index와 value로 이루어져 있습니다
- 한가지 데이터 타입만 가질 수 있습니다

In [2]:
import pandas as pd
import numpy as np

- pandas 는 통상 pd
- numpy 는 통상 np

In [12]:
pd.Series()

Series([], dtype: object)

In [13]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
pd.Series([1, 2, 3, 4], dtype=float64)

NameError: name 'float64' is not defined

In [15]:
pd.Series([1, 2, 3, 4], dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [16]:
pd.Series([1, 2, 3, 4], dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [18]:
pd.Series(np.array([1, 2, 3]))

0    1
1    2
2    3
dtype: int32

In [19]:
pd.Series({"Key" : "Value"})

Key    Value
dtype: object

In [21]:
data = pd.Series([1, 2, 3, 4, "5"])
data

0    1
1    2
2    3
3    4
4    5
dtype: object

In [22]:
# 짝수를 찾고 싶다
data % 2

TypeError: not all arguments converted during string formatting

In [23]:
data = pd.Series([1, 2, 3, 4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
data % 2

0    1
1    0
2    1
3    0
dtype: int64

 #### 날짜 데이터

In [8]:
dates = pd.date_range("20210101", periods = 6)
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

 ### DataFrame
- pd.Series()
    - index, value
- pd.DataFrame()
    - index, value, column

In [6]:
 # 표준정규분포에서 샘플링한 난수 생성
data = np.random.randn(6, 4)
data

array([[ 1.12529662,  0.76718274,  0.48590407,  2.1663448 ],
       [-1.05230782, -0.41363475, -0.0671449 , -0.19996723],
       [ 0.01513291, -1.69445865, -2.20475414, -0.61652752],
       [-0.61287889,  0.87521006, -0.54612076,  1.31142527],
       [-1.04724761,  1.95514803, -0.73823574, -1.02428937],
       [-0.20539254,  0.21923504, -0.99690594, -0.45873526]])

In [10]:
df = pd.DataFrame(data, index = dates, columns=["A", "B", "C", "D"])
df

                   A         B         C         D
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735

 ### 데이터 프레임 정보 탐색

- df.head()

In [13]:
df.head()

                   A         B         C         D
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289

- df.tail()

In [15]:
df.tail()

                   A         B         C         D
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735

In [17]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[ 1.12529662,  0.76718274,  0.48590407,  2.1663448 ],
       [-1.05230782, -0.41363475, -0.0671449 , -0.19996723],
       [ 0.01513291, -1.69445865, -2.20475414, -0.61652752],
       [-0.61287889,  0.87521006, -0.54612076,  1.31142527],
       [-1.04724761,  1.95514803, -0.73823574, -1.02428937],
       [-0.20539254,  0.21923504, -0.99690594, -0.45873526]])

- df.info() : 데이터 프레임의 기본 정보 확인

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

- df.describe() : 데이터 프레임의 기술통계 정보 확인

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.296233  0.284780 -0.677876  0.196375
std    0.819986  1.247471  0.914496  1.253890
min   -1.052308 -1.694459 -2.204754 -1.024289
25%   -0.938655 -0.255417 -0.932238 -0.577079
50%   -0.409136  0.493209 -0.642178 -0.329351
75%   -0.039998  0.848203 -0.186889  0.933577
max    1.125297  1.955148  0.485904  2.166345

 ### 데이터 정렬
- sort_values()
- 특정 컬럼(열)을 기준으로 데이터 정렬

In [22]:
df

                   A         B         C         D
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735

In [54]:
df

                   A         B         C         D      E
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289    one
2021-01-04 -0.612879  0.875210 -0.546121  1.311425    one
2021-01-01  1.125297  0.767183  0.485904  2.166345    two
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735  three
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967   four
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528    six

 ### 데이터 선택

In [28]:
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [29]:
 # 한 개 컬럼 선택
df["A"]

2021-01-05   -1.047248
2021-01-04   -0.612879
2021-01-01    1.125297
2021-01-06   -0.205393
2021-01-02   -1.052308
2021-01-03    0.015133
Name: A, dtype: float64

In [30]:
type(df["A"])

pandas.core.series.Series

In [31]:
df.A

2021-01-05   -1.047248
2021-01-04   -0.612879
2021-01-01    1.125297
2021-01-06   -0.205393
2021-01-02   -1.052308
2021-01-03    0.015133
Name: A, dtype: float64

In [34]:
 # 두 개 이상 컬럼 선택
df[["A","B"]]

                   A         B
2021-01-05 -1.047248  1.955148
2021-01-04 -0.612879  0.875210
2021-01-01  1.125297  0.767183
2021-01-06 -0.205393  0.219235
2021-01-02 -1.052308 -0.413635
2021-01-03  0.015133 -1.694459

 ### offset index
- [n:m] : n부터 m-1 까지
- 인덱스나 컬럼의 이름으로 slice 하는 경우는 끝을 포함합니다

In [36]:
df[0:3]

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345

- loc : location
- index 이름으로 특정 행, 열을 선택

In [37]:
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [38]:
df.loc[:,["A","B"]]

                   A         B
2021-01-05 -1.047248  1.955148
2021-01-04 -0.612879  0.875210
2021-01-01  1.125297  0.767183
2021-01-06 -0.205393  0.219235
2021-01-02 -1.052308 -0.413635
2021-01-03  0.015133 -1.694459

In [39]:
df.loc["20210102":"20210104",["A", "D"]]

                   A         D
2021-01-04 -0.612879  1.311425
2021-01-02 -1.052308 -0.199967
2021-01-03  0.015133 -0.616528

- iloc : inter location
    - 컴퓨터가 인식하는 인덱스 값으로 선택

In [40]:
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [41]:
df.iloc[3]

A   -0.205393
B    0.219235
C   -0.996906
D   -0.458735
Name: 2021-01-06 00:00:00, dtype: float64

 #### condition

In [44]:
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [47]:
# A 컬럼보다 0보다 큰 숫자(양수)만 선택

df["A"] > 0

2021-01-05    False
2021-01-04    False
2021-01-01     True
2021-01-06    False
2021-01-02    False
2021-01-03     True
Name: A, dtype: bool

In [48]:
df[df["A"]>0]

                   A         B         C         D
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

- NaN : Not A Number

#### 컬럼 추가
- 기존 컬럼이 없으면 추가
- 있으면 수정

In [49]:
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [52]:
df["E"] = ["one", "one", "two", "three", "four", "six"]

In [53]:
df

                   A         B         C         D      E
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289    one
2021-01-04 -0.612879  0.875210 -0.546121  1.311425    one
2021-01-01  1.125297  0.767183  0.485904  2.166345    two
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735  three
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967   four
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528    six

- isin()
- 특정 요소가 있는지 확인

In [55]:
df["E"].isin(["two", "five"])

2021-01-05    False
2021-01-04    False
2021-01-01     True
2021-01-06    False
2021-01-02    False
2021-01-03    False
Name: E, dtype: bool

### 특정 컬럼 제거
- del
- drop

In [56]:
df

                   A         B         C         D      E
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289    one
2021-01-04 -0.612879  0.875210 -0.546121  1.311425    one
2021-01-01  1.125297  0.767183  0.485904  2.166345    two
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735  three
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967   four
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528    six

In [57]:
del df["E"]
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [58]:
df.drop(["D"], axis=1) # axis=0 가로, axis=1 세로

                   A         B         C
2021-01-05 -1.047248  1.955148 -0.738236
2021-01-04 -0.612879  0.875210 -0.546121
2021-01-01  1.125297  0.767183  0.485904
2021-01-06 -0.205393  0.219235 -0.996906
2021-01-02 -1.052308 -0.413635 -0.067145
2021-01-03  0.015133 -1.694459 -2.204754

### apply()

In [59]:
df

                   A         B         C         D
2021-01-05 -1.047248  1.955148 -0.738236 -1.024289
2021-01-04 -0.612879  0.875210 -0.546121  1.311425
2021-01-01  1.125297  0.767183  0.485904  2.166345
2021-01-06 -0.205393  0.219235 -0.996906 -0.458735
2021-01-02 -1.052308 -0.413635 -0.067145 -0.199967
2021-01-03  0.015133 -1.694459 -2.204754 -0.616528

In [60]:
df["A"].apply("sum")

-1.7773973239451804

In [61]:
df["A"].apply("mean")

-0.2962328873241967

In [62]:
df["A"].apply("min"),df["A"].apply("max")

(-1.052307820364569, 1.125296615229644)

In [63]:
df[["A", "D"]].apply("sum")

A   -1.777397
D    1.178251
dtype: float64

In [64]:
df["A"].apply(np.sum)

2021-01-05   -1.047248
2021-01-04   -0.612879
2021-01-01    1.125297
2021-01-06   -0.205393
2021-01-02   -1.052308
2021-01-03    0.015133
Name: A, dtype: float64

In [65]:
def plusminus(num):
    return "plus" if num > 0 else "minus"

In [66]:
df["A"].apply(plusminus)

2021-01-05    minus
2021-01-04    minus
2021-01-01     plus
2021-01-06    minus
2021-01-02    minus
2021-01-03     plus
Name: A, dtype: object